org/bdd/03_modelo_relacional.org
#+title:Modelo Relacional
#+date:<2020-02-03 Mon>
* Diseño lógico
** Arquitectura de 3 capas ANSI/SPARC
   Modelo lógico Es un paso intermedio entre el modelo conceptual y el modelo
   interno, que formaliza las descripciones del modelo conceptual.
* Modelo Relacional
** Estructura
*** El modelo relacional
**** Dominios y Relaciones [ELM16 5.1]
     Las bases de datos relacionales se basan en un modelo lógico introducido
     por Codd en 1970, conocido como modelo relacional

     El mismo es una formalización matemática basada en el concepto de relación

     Algunas definiciones:

     - Dominio: Es un conjunto de valores homogéneos.
       - Ejemplo: D_1 = {Barcelona, Sevilla, Buenos Aires}
       - D_2 = {Argentina, España, Chile}
     - Producto cartesiano: A \times B se define como el conjunto de pares (a,b) que
       cumplen que a \in A y b \in B.
       - En nuestro ejemplo, D_1 \times D_2 = {(Barcelona, Argentina), (Barcelona,
         España), (Barcelona, Chile), (Sevilla, Argentina), (Sevilla, España),
         (Sevilla, Chile),(Buenos Aires, Argentina), (Buenos Aires, España),
         (Buenos Aires, Chile)}
     - Relación: es un subconjunto de un producto cartesiano.

     En el ejemplo anterior podría especialmente interesarnos la siguiente
     relación: R = {(Barcelona, España), (Sevilla, España), (Buenos Aires,
     Argentina)}

**** Formalizacion
     En el modelo relacional, un nombre de relación R junto con una lista de
     atributos asociados se denomina esquema de relación , y se denota de la
     siguiente manera:

     - R(A_{1},A_{2}, ...,A_{n})
     - Ejemplo: Películas(nombre_película, año, nombre_director, cant_oscars)

     Cada uno de los atributos de un esquema de relación está asociado a un
     dominio particular.

     - El dominio de un atributo A_{i} se denota dom(A_{i})
     - En nuestro ejemplo:
       - nombre_película → dom(nombre_pelicula) =string
       - año → dom(año) = N^+
       - nombre_director → dom(nombre_director ) =string
       - cant_oscars → dom(cant_oscars) = N^+

     El grado de una relación es la cantidad de atributos que posee su esquema.
     - La relación Películas tiene grado 4.
*** Relaciones y tuplas
    Una relación R con esquema de relación R(A_{1},A_{2}, ...,A_{n}) -estando
    los atributos A_{i} asociados a los dominios D_i = dom(A_{i})- es un
    subconjunto del producto cartesiano D_1_\times D_2_\times ... \times D_n.

    - Dado el esquema de relación $Películas(nombre_película, año,
      nombre_director, cant_oscars)$, se cumple que:
      - $Películas \subset dom(nombre_pelicula) \times dom(año) \times
        dom(nombre_director ) \times dom(cant_oscars)$
    - Por ejemplo:
      - Películas = {(Kill Bill, 2003, Quentin Tarantino, 0), (Django Unchained,
        2012, Quentin Tarantino, 2), (Star Wars III, 2005, George Lucas, 0), (El
        Cisne Negro, 2010, Darren Aronofsky, 1)}

        Una elemento de una relación se denomina tupla .

        - t = (Kill Bill, 2003, Quentin Tarantino, 0) es una tupla de Películas.
        - Lo denotamos como t \in Películas.
        - u = (Kill Bill, 2003, Quentin Tarantino, 3) no es una tupla de
          Películas.
        - u \nin Películas.
*** Relaciones y tuplas
    Al margen... Si pensamos a una relación como un predicado, podemos predicar
    que Películas(Kill Bill, 2003, Quentin Tarantino, 3) = F .

    El valor tomado por un atributo A en la tupla t se denota t[A] o t.A.
    - t[nombre_director ] = t.nombre_director = Quentin Tarantino.
    - t[nombre_pelicula, año] = t.(nombre_pelicula, año) = (Kill Bill, 2003).

    La cardinalidad de una relación R es la cantidad de tuplas que posee.
    - La simbolizaremos |R| o bien n(R).
    - Ejemplo: |Películas| = 4.
*** Tablas
    Una forma útil de representar una relación es a través de una tabla en la
    que las columnas representan los atributos y las filas representan las
    tuplas. En el caso de la relación Películas:

    | nombre_película  |  año | nombre_director   | cant_oscars |
    | Kill Bill        | 2003 | Quentin Tarantino |           0 |
    | Django Unchained | 2012 | Quentin Tarantino |           2 |
    | Star Wars III    | 2005 | George Lucas      |           0 |
    | El Cisne Negro   | 2010 | Darren Aronofsky  |           1 |

    Otra nomenclatura comúnmente utilizada –y más vinculada al nivel físico–
    habla de archivos en lugar de tablas, registros en lugar de filas, y campos
    en lugar de columnas.
** Restricciones
*** Restricciones de dominio [ELM16 5.1 5.2.1]
    Las relaciones del modelo relacional representan generalmente entidades o
    interrelaciones de nuestro modelo de datos.

    Deben cumplir una serie de restricciones de distintos tipos.

    Restricciones de dominio

    Las restricciones de dominio especifican que dado un atributo A de una
    relación R, el valor del atributo en una tupla t debe pertenecer al dominio
    dom(A).

    Algunos dominios posibles:
    - N, N^+, R, R^+.
    - caracter, string, valor booleano, fecha, conjunto finito (categorías).

    En el modelo relacional se puede permitir que algunos de los atributos tomen
    un valor nulo (NULL) .

    Los atributos deben ser atómicos (no se permiten atributos compuestos o
    multivaluados).
