bdd/03_modelo_relacional.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-01 Fri 11:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Modelo Relacional</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="/res/org.css"/>
<link rel="stylesheet" type="text/css" href="/home/mk/Documents/blogs/org.css"/>
</head>
<body>
<div id="content">
<div id="outline-container-org49da46c" class="outline-2">
<h2 id="org49da46c">Diseño lógico</h2>
<div class="outline-text-2" id="text-org49da46c">
</div>
<div id="outline-container-org2463c2b" class="outline-3">
<h3 id="org2463c2b">Arquitectura de 3 capas ANSI/SPARC</h3>
<div class="outline-text-3" id="text-org2463c2b">
<p>
Modelo lógico Es un paso intermedio entre el modelo conceptual y el modelo
interno, que formaliza las descripciones del modelo conceptual.
</p>
</div>
</div>
</div>
<div id="outline-container-org7f9abfc" class="outline-2">
<h2 id="org7f9abfc">Modelo Relacional</h2>
<div class="outline-text-2" id="text-org7f9abfc">
</div>
<div id="outline-container-org61dd808" class="outline-3">
<h3 id="org61dd808">Estructura</h3>
<div class="outline-text-3" id="text-org61dd808">
</div>
<div id="outline-container-orga33aee7" class="outline-4">
<h4 id="orga33aee7">El modelo relacional</h4>
<div class="outline-text-4" id="text-orga33aee7">
</div>
<div id="outline-container-org446fc70" class="outline-5">
<h5 id="org446fc70">Dominios y Relaciones [ELM16 5.1]</h5>
<div class="outline-text-5" id="text-org446fc70">
<p>
Las bases de datos relacionales se basan en un modelo lógico introducido
por Codd en 1970, conocido como modelo relacional
</p>

<p>
El mismo es una formalización matemática basada en el concepto de relación
</p>

<p>
Algunas definiciones:
</p>

<ul class="org-ul">
<li>Dominio: Es un conjunto de valores homogéneos.
<ul class="org-ul">
<li>Ejemplo: D_1 = {Barcelona, Sevilla, Buenos Aires}</li>
<li>D_2 = {Argentina, España, Chile}</li>
</ul></li>
<li>Producto cartesiano: A &times; B se define como el conjunto de pares (a,b) que
cumplen que a &isin; A y b &isin; B.
<ul class="org-ul">
<li>En nuestro ejemplo, D_1 &times; D_2 = {(Barcelona, Argentina), (Barcelona,
España), (Barcelona, Chile), (Sevilla, Argentina), (Sevilla, España),
(Sevilla, Chile),(Buenos Aires, Argentina), (Buenos Aires, España),
(Buenos Aires, Chile)}</li>
</ul></li>
<li>Relación: es un subconjunto de un producto cartesiano.</li>
</ul>

<p>
En el ejemplo anterior podría especialmente interesarnos la siguiente
relación: R = {(Barcelona, España), (Sevilla, España), (Buenos Aires,
Argentina)}
</p>
</div>
</div>

<div id="outline-container-org749767d" class="outline-5">
<h5 id="org749767d">Formalizacion</h5>
<div class="outline-text-5" id="text-org749767d">
<p>
En el modelo relacional, un nombre de relación R junto con una lista de
atributos asociados se denomina esquema de relación , y se denota de la
siguiente manera:
</p>

<ul class="org-ul">
<li>R(A<sub>1</sub>,A<sub>2</sub>, &#x2026;,A<sub>n</sub>)</li>
<li>Ejemplo: Películas(nombre_película, año, nombre_director, cant_oscars)</li>
</ul>

<p>
Cada uno de los atributos de un esquema de relación está asociado a un
dominio particular.
</p>

<ul class="org-ul">
<li>El dominio de un atributo A<sub>i</sub> se denota dom(A<sub>i</sub>)</li>
<li>En nuestro ejemplo:
<ul class="org-ul">
<li>nombre_película → dom(nombre_pelicula) =string</li>
<li>año → dom(año) = N^+</li>
<li>nombre_director → dom(nombre_director ) =string</li>
<li>cant_oscars → dom(cant_oscars) = N^+</li>
</ul></li>
</ul>

<p>
El grado de una relación es la cantidad de atributos que posee su esquema.
</p>
<ul class="org-ul">
<li>La relación Películas tiene grado 4.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb93c28c" class="outline-4">
<h4 id="orgb93c28c">Relaciones y tuplas</h4>
<div class="outline-text-4" id="text-orgb93c28c">
<p>
Una relación R con esquema de relación R(A<sub>1</sub>,A<sub>2</sub>, &#x2026;,A<sub>n</sub>) -estando
los atributos A<sub>i</sub> asociados a los dominios D_i = dom(A<sub>i</sub>)- es un
subconjunto del producto cartesiano D_1_&times; D_2_&times; &#x2026; &times; D_n.
</p>

<ul class="org-ul">
<li>Dado el esquema de relación \(Películas(nombre_película, año,
      nombre_director, cant_oscars)\), se cumple que:
<ul class="org-ul">
<li>\(Películas \subset dom(nombre_pelicula) \times dom(año) \times
        dom(nombre_director ) \times dom(cant_oscars)\)</li>
</ul></li>
<li>Por ejemplo:
<ul class="org-ul">
<li><p>
Películas = {(Kill Bill, 2003, Quentin Tarantino, 0), (Django Unchained,
2012, Quentin Tarantino, 2), (Star Wars III, 2005, George Lucas, 0), (El
Cisne Negro, 2010, Darren Aronofsky, 1)}
</p>

<p>
Una elemento de una relación se denomina tupla .
</p>

<ul class="org-ul">
<li>t = (Kill Bill, 2003, Quentin Tarantino, 0) es una tupla de Películas.</li>
<li>Lo denotamos como t &isin; Películas.</li>
<li>u = (Kill Bill, 2003, Quentin Tarantino, 3) no es una tupla de
Películas.</li>
<li>u \nin Películas.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgc73f992" class="outline-4">
<h4 id="orgc73f992">Relaciones y tuplas</h4>
<div class="outline-text-4" id="text-orgc73f992">
<p>
Al margen&#x2026; Si pensamos a una relación como un predicado, podemos predicar
que Películas(Kill Bill, 2003, Quentin Tarantino, 3) = F .
</p>

<p>
El valor tomado por un atributo A en la tupla t se denota t[A] o t.A.
</p>
<ul class="org-ul">
<li>t[nombre_director ] = t.nombre_director = Quentin Tarantino.</li>
<li>t[nombre_pelicula, año] = t.(nombre_pelicula, año) = (Kill Bill, 2003).</li>
</ul>

<p>
La cardinalidad de una relación R es la cantidad de tuplas que posee.
</p>
<ul class="org-ul">
<li>La simbolizaremos |R| o bien n(R).</li>
<li>Ejemplo: |Películas| = 4.</li>
</ul>
</div>
</div>
<div id="outline-container-orge44a03a" class="outline-4">
<h4 id="orge44a03a">Tablas</h4>
<div class="outline-text-4" id="text-orge44a03a">
<p>
Una forma útil de representar una relación es a través de una tabla en la
que las columnas representan los atributos y las filas representan las
tuplas. En el caso de la relación Películas:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_película</td>
<td class="org-right">año</td>
<td class="org-left">nombre_director</td>
<td class="org-right">cant_oscars</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-right">2003</td>
<td class="org-left">Quentin Tarantino</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Django Unchained</td>
<td class="org-right">2012</td>
<td class="org-left">Quentin Tarantino</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-right">2005</td>
<td class="org-left">George Lucas</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">El Cisne Negro</td>
<td class="org-right">2010</td>
<td class="org-left">Darren Aronofsky</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>

<p>
Otra nomenclatura comúnmente utilizada –y más vinculada al nivel físico–
habla de archivos en lugar de tablas, registros en lugar de filas, y campos
en lugar de columnas.
</p>
</div>
</div>
</div>
<div id="outline-container-orga372758" class="outline-3">
<h3 id="orga372758">Restricciones</h3>
<div class="outline-text-3" id="text-orga372758">
</div>
<div id="outline-container-orga7e0946" class="outline-4">
<h4 id="orga7e0946">Restricciones de dominio [ELM16 5.1 5.2.1]</h4>
<div class="outline-text-4" id="text-orga7e0946">
<p>
Las relaciones del modelo relacional representan generalmente entidades o
interrelaciones de nuestro modelo de datos.
</p>

<p>
Deben cumplir una serie de restricciones de distintos tipos.
</p>

<p>
Restricciones de dominio
</p>

<p>
Las restricciones de dominio especifican que dado un atributo A de una
relación R, el valor del atributo en una tupla t debe pertenecer al dominio
dom(A).
</p>

<p>
Algunos dominios posibles:
</p>
<ul class="org-ul">
<li>N, N^+, R, R^+.</li>
<li>caracter, string, valor booleano, fecha, conjunto finito (categorías).</li>
</ul>

<p>
En el modelo relacional se puede permitir que algunos de los atributos tomen
un valor nulo (NULL) .
</p>

<p>
Los atributos deben ser atómicos (no se permiten atributos compuestos o
multivaluados).
</p>
</div>
</div>
