org/bdd/03_modelo_relacional.org
*** Restricciones de unicidad [ELM16 5.2.2]
    No pueden existir dos tuplas distintas que coincidan en los valores de todos
    sus atributos.
    - I.e., una tupla no puede estar dos veces!

    Sin embargo, generalmente existe un subconjunto SK del conjunto de atributos
    (A_{1},A_{2}, ...,A_{n}) de R que cumple la condición de que dadas dos tuplas s, t
    \in R, las mismas difieren en al menos uno de los atributos de SK .
    - \exists k \in SK : s[k ] 6= t[k ].

    Cuando un subconjunto SK cumple esta propiedad, diremos que SK es una
    superclave de R.

    Nos interesan aquellas superclaves que son minimales, es decir que no
    admiten ningún subconjunto propio con la misma propiedad. A estas
    superclaves las llamaremos claves candidatas o simplemente claves .

    De entre todas las claves candidatas elegiremos una como clave primaria de
    la relación. La indicaremos subrayada en el esquema.

    Ejemplo

    Películas(nombre_película, año, nombre_director, cant_oscars)

    Si suponemos que no puede haber dos películas con el mismo nombre
    - “nombre_película” es clave candidata.
    - Es la única. La designaremos como clave primaria.
    - Lo representamos como: Películas(nombre_película, año, nombre_director,
      cant_oscars).
    - {nombre_película, cant_oscars} es superclave, pero no es clave candidata
      porque no es minimal.

    Si admitimos que existen películas distintas con el mismo nombre
    - Deberíamos crear un atributo “id” que nos permita identificar a cada película
    - El esquema de relación sería ahora: Películas(id, nombre_película, año,
      nombre_director, cant_oscars)
    - “id” será la clave primaria.
    - {id, nombre_película} es superclave, pero no es clave candidata!

    Ejemplo

    ActoresPelículas(nombre_película, año, nombre_director, cant_oscars,
    nombre_actor)

    | nombre_película  |  año | nombre_director   | cant_oscars | nombre_actor      |
    | Kill Bill        | 2003 | Quentin Tarantino |           0 | Uma Thurman       |
    | Django Unchained | 2012 | Quentin Tarantino |           2 | Leonardo DiCaprio |
    | Django Unchained | 2012 | Quentin Tarantino |           2 | Samuel L. Jackson |
    | Star Wars III    | 2005 | George Lucas      |           0 | Samuel L. Jackson |
    | Star Wars III    | 2005 | George Lucas      |           0 | Natalie Portman   |
    | El Cisne Negro   | 2010 | Darren Aronofsky  |           1 | Natalie Portman   |

    Ya no alcanza “nombre_película” para identificar una tupla.

    La clave de la relación ActoresPelículas es {nombre_película, nombre_actor}!

    Nota: Desde ya, este es un diseño desprolijo, por contener información
    redundante sobre las películas en distintas tuplas.
*** Esquemas de base de datos [ELM16 5.2.3]
    Las bases de datos almacenan múltiples esquemas de relación, muchas veces
    relacionados entre ellos.

    En el modelo relacional, una base de datos se representa a través de un
    esquema de base de datos relacional.

    Un esquema de base de datos relacional S es un conjunto de esquemas de
    relación S = {R_1,R_2, ...,R_m} junto con una serie de restricciones de
    integridad.

    Ejemplo: Cine = {Películas, Actores, Actuaciones}, en donde:
    - Películas(nombre_película, año, nombre_director, cant_oscars)
    - Actores(nombre_actor, país)
    - Actuaciones(nombre_película, nombre_actor)

    La siguiente es una posible instancia de nuestra base de datos Cine:

    PELÍCULAS
    | nombre_película  |  año | nombre_director   | cant_oscars |
    | Kill Bill        | 2003 | Quentin Tarantino |           0 |
    | Django Unchained | 2012 | Quentin Tarantino |           2 |
    | Star Wars III    | 2005 | George Lucas      |           0 |
    | El Cisne Negro   | 2010 | Darren Aronofsky  |           1 |

    ACTORES
    | nombre_actor      | país           |
    | Uma Thurman       | Estados Unidos |
    | Leonardo DiCaprio | Estados Unidos |
    | Samuel L. Jackson | Estados Unidos |
    | Natalie Portman   | Israel         |

    ACTUACIONES
    | nombre_película  | nombre_actor      |
    | Kill Bill        | Uma Thurman       |
    | Django Unchained | Leonardo DiCaprio |
    | Django Unchained | Samuel L. Jackson |
    | Star Wars III    | Samuel L. Jackson |
    | Star Wars III    | Natalie Portman   |
    | El Cisne Negro   | Natalie Portman   |

*** Restricciones de integridad [ELM16 5.2.4]
    Restricción de integridad de entidad: La clave primaria de una relación no
    puede tomar el valor nulo.

    Restricción de integridad referencial: Cuando un conjunto de atributos FK de
    una relación R hace referencia a la clave primaria de otra relación S (es
    decir, representa el mismo concepto del mundo real que S), entonces para
    toda tupla de R debe existir una tupla de S cuya clave primaria sea igual al
    valor de FK , a menos que todos los atributos de FK sean nulos.

    Cine = {Películas, Actores, Actuaciones}
    - Películas(nombre_película, año, nombre_director, cant_oscars)
    - Actores(nombre_actor, país)
    - Actuaciones(nombre_película, nombre_actor)

    Ejemplo: Si una tupla en Actuaciones hace referencia “Star Wars III”,
    entonces debe existir “Star Wars III” en la relación Películas.

    Formalmente:

    - Sean R(A_{1},A_{2}, ...,A_r)y S(B_1,B_2, ...,B_s) dos esquemas de relación.
    - FK \subset (A_{1},A_{2}, ...,A_r) hace referencia a S, cuya clave primaria es
      PK \subset (B_1,B_2, ...,B_s).
    - Entonces:
      - ∀t \in R : t[FK ] 6= NULL → \exists s \in S : s[PK ] = t[FK ].

    FK se denomina clave foránea de S en R.

    Estas restricciones generalmente surgen de las interrelaciones entre
    entidades de nuestro modelo conceptual.

    Cine = {Películas, Actores, Actuaciones} Películas(nombre_película, año,
    nombre_director, cant_oscars) Actores(nombre_actor, país)
    Actuaciones(nombre_película, nombre_actor)

    En nuestro ejemplo de la base de datos Cine, Actuaciones.nombre_película es
    clave foránea y hace referencia a la relación Películas. Asímismo,
    Actuaciones.nombre_actor es clave foránea y hace referencia a la relación
    Actores.

    Indicaremos a las claves foráneas con un subrayado punteado.
