bdd/03_modelo_relacional.html
<div id="outline-container-org4cba63a" class="outline-4">
<h4 id="org4cba63a">Restricciones de unicidad [ELM16 5.2.2]</h4>
<div class="outline-text-4" id="text-org4cba63a">
<p>
No pueden existir dos tuplas distintas que coincidan en los valores de todos
sus atributos.
</p>
<ul class="org-ul">
<li>I.e., una tupla no puede estar dos veces!</li>
</ul>

<p>
Sin embargo, generalmente existe un subconjunto SK del conjunto de atributos
(A<sub>1</sub>,A<sub>2</sub>, &#x2026;,A<sub>n</sub>) de R que cumple la condición de que dadas dos tuplas s, t
&isin; R, las mismas difieren en al menos uno de los atributos de SK .
</p>
<ul class="org-ul">
<li>&exist; k &isin; SK : s[k ] 6= t[k ].</li>
</ul>

<p>
Cuando un subconjunto SK cumple esta propiedad, diremos que SK es una
superclave de R.
</p>

<p>
Nos interesan aquellas superclaves que son minimales, es decir que no
admiten ningún subconjunto propio con la misma propiedad. A estas
superclaves las llamaremos claves candidatas o simplemente claves .
</p>

<p>
De entre todas las claves candidatas elegiremos una como clave primaria de
la relación. La indicaremos subrayada en el esquema.
</p>

<p>
Ejemplo
</p>

<p>
Películas(nombre_película, año, nombre_director, cant_oscars)
</p>

<p>
Si suponemos que no puede haber dos películas con el mismo nombre
</p>
<ul class="org-ul">
<li>“nombre_película” es clave candidata.</li>
<li>Es la única. La designaremos como clave primaria.</li>
<li>Lo representamos como: Películas(nombre_película, año, nombre_director,
cant_oscars).</li>
<li>{nombre_película, cant_oscars} es superclave, pero no es clave candidata
porque no es minimal.</li>
</ul>

<p>
Si admitimos que existen películas distintas con el mismo nombre
</p>
<ul class="org-ul">
<li>Deberíamos crear un atributo “id” que nos permita identificar a cada película</li>
<li>El esquema de relación sería ahora: Películas(id, nombre_película, año,
nombre_director, cant_oscars)</li>
<li>“id” será la clave primaria.</li>
<li>{id, nombre_película} es superclave, pero no es clave candidata!</li>
</ul>

<p>
Ejemplo
</p>

<p>
ActoresPelículas(nombre_película, año, nombre_director, cant_oscars,
nombre_actor)
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_película</td>
<td class="org-right">año</td>
<td class="org-left">nombre_director</td>
<td class="org-right">cant_oscars</td>
<td class="org-left">nombre_actor</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-right">2003</td>
<td class="org-left">Quentin Tarantino</td>
<td class="org-right">0</td>
<td class="org-left">Uma Thurman</td>
</tr>

<tr>
<td class="org-left">Django Unchained</td>
<td class="org-right">2012</td>
<td class="org-left">Quentin Tarantino</td>
<td class="org-right">2</td>
<td class="org-left">Leonardo DiCaprio</td>
</tr>

<tr>
<td class="org-left">Django Unchained</td>
<td class="org-right">2012</td>
<td class="org-left">Quentin Tarantino</td>
<td class="org-right">2</td>
<td class="org-left">Samuel L. Jackson</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-right">2005</td>
<td class="org-left">George Lucas</td>
<td class="org-right">0</td>
<td class="org-left">Samuel L. Jackson</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-right">2005</td>
<td class="org-left">George Lucas</td>
<td class="org-right">0</td>
<td class="org-left">Natalie Portman</td>
</tr>

<tr>
<td class="org-left">El Cisne Negro</td>
<td class="org-right">2010</td>
<td class="org-left">Darren Aronofsky</td>
<td class="org-right">1</td>
<td class="org-left">Natalie Portman</td>
</tr>
</tbody>
</table>

<p>
Ya no alcanza “nombre_película” para identificar una tupla.
</p>

<p>
La clave de la relación ActoresPelículas es {nombre_película, nombre_actor}!
</p>

<p>
Nota: Desde ya, este es un diseño desprolijo, por contener información
redundante sobre las películas en distintas tuplas.
</p>
</div>
</div>
<div id="outline-container-org69375d0" class="outline-4">
<h4 id="org69375d0">Esquemas de base de datos [ELM16 5.2.3]</h4>
<div class="outline-text-4" id="text-org69375d0">
<p>
Las bases de datos almacenan múltiples esquemas de relación, muchas veces
relacionados entre ellos.
</p>

<p>
En el modelo relacional, una base de datos se representa a través de un
esquema de base de datos relacional.
</p>

<p>
Un esquema de base de datos relacional S es un conjunto de esquemas de
relación S = {R_1,R_2, &#x2026;,R_m} junto con una serie de restricciones de
integridad.
</p>

<p>
Ejemplo: Cine = {Películas, Actores, Actuaciones}, en donde:
</p>
<ul class="org-ul">
<li>Películas(nombre_película, año, nombre_director, cant_oscars)</li>
<li>Actores(nombre_actor, país)</li>
<li>Actuaciones(nombre_película, nombre_actor)</li>
</ul>

<p>
La siguiente es una posible instancia de nuestra base de datos Cine:
</p>

<p>
PELÍCULAS
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_película</td>
<td class="org-right">año</td>
<td class="org-left">nombre_director</td>
<td class="org-right">cant_oscars</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-right">2003</td>
<td class="org-left">Quentin Tarantino</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Django Unchained</td>
<td class="org-right">2012</td>
<td class="org-left">Quentin Tarantino</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-right">2005</td>
<td class="org-left">George Lucas</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">El Cisne Negro</td>
<td class="org-right">2010</td>
<td class="org-left">Darren Aronofsky</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>

<p>
ACTORES
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_actor</td>
<td class="org-left">país</td>
</tr>

<tr>
<td class="org-left">Uma Thurman</td>
<td class="org-left">Estados Unidos</td>
</tr>

<tr>
<td class="org-left">Leonardo DiCaprio</td>
<td class="org-left">Estados Unidos</td>
</tr>

<tr>
<td class="org-left">Samuel L. Jackson</td>
<td class="org-left">Estados Unidos</td>
</tr>

<tr>
<td class="org-left">Natalie Portman</td>
<td class="org-left">Israel</td>
</tr>
</tbody>
</table>

<p>
ACTUACIONES
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">nombre_película</td>
<td class="org-left">nombre_actor</td>
</tr>

<tr>
<td class="org-left">Kill Bill</td>
<td class="org-left">Uma Thurman</td>
</tr>

<tr>
<td class="org-left">Django Unchained</td>
<td class="org-left">Leonardo DiCaprio</td>
</tr>

<tr>
<td class="org-left">Django Unchained</td>
<td class="org-left">Samuel L. Jackson</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-left">Samuel L. Jackson</td>
</tr>

<tr>
<td class="org-left">Star Wars III</td>
<td class="org-left">Natalie Portman</td>
</tr>

<tr>
<td class="org-left">El Cisne Negro</td>
<td class="org-left">Natalie Portman</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7095e56" class="outline-4">
<h4 id="org7095e56">Restricciones de integridad [ELM16 5.2.4]</h4>
<div class="outline-text-4" id="text-org7095e56">
<p>
Restricción de integridad de entidad: La clave primaria de una relación no
puede tomar el valor nulo.
</p>

<p>
Restricción de integridad referencial: Cuando un conjunto de atributos FK de
una relación R hace referencia a la clave primaria de otra relación S (es
decir, representa el mismo concepto del mundo real que S), entonces para
toda tupla de R debe existir una tupla de S cuya clave primaria sea igual al
valor de FK , a menos que todos los atributos de FK sean nulos.
</p>

<p>
Cine = {Películas, Actores, Actuaciones}
</p>
<ul class="org-ul">
<li>Películas(nombre_película, año, nombre_director, cant_oscars)</li>
<li>Actores(nombre_actor, país)</li>
<li>Actuaciones(nombre_película, nombre_actor)</li>
</ul>

<p>
Ejemplo: Si una tupla en Actuaciones hace referencia “Star Wars III”,
entonces debe existir “Star Wars III” en la relación Películas.
</p>

<p>
Formalmente:
</p>

<ul class="org-ul">
<li>Sean R(A<sub>1</sub>,A<sub>2</sub>, &#x2026;,A_r)y S(B_1,B_2, &#x2026;,B_s) dos esquemas de relación.</li>
<li>FK &sub; (A<sub>1</sub>,A<sub>2</sub>, &#x2026;,A_r) hace referencia a S, cuya clave primaria es
PK &sub; (B_1,B_2, &#x2026;,B_s).</li>
<li>Entonces:
<ul class="org-ul">
<li>∀t &isin; R : t[FK ] 6= NULL → &exist; s &isin; S : s[PK ] = t[FK ].</li>
</ul></li>
</ul>

<p>
FK se denomina clave foránea de S en R.
</p>

<p>
Estas restricciones generalmente surgen de las interrelaciones entre
entidades de nuestro modelo conceptual.
</p>

<p>
Cine = {Películas, Actores, Actuaciones} Películas(nombre_película, año,
nombre_director, cant_oscars) Actores(nombre_actor, país)
Actuaciones(nombre_película, nombre_actor)
</p>

<p>
En nuestro ejemplo de la base de datos Cine, Actuaciones.nombre_película es
clave foránea y hace referencia a la relación Películas. Asímismo,
Actuaciones.nombre_actor es clave foránea y hace referencia a la relación
Actores.
</p>

<p>
Indicaremos a las claves foráneas con un subrayado punteado.
</p>
</div>
</div>
</div>
