org/bdd/03_modelo_relacional.org
** Operaciones
*** Operaciones
    Las operaciones del modelo relacional se especifican a través de lenguajes
    como el álgebra relacional o el cálculo relacional.

    Operaciones Consulta Actualización Inserción Eliminación Modificación
*** Operaciones e integridad [ELM16 5.3]
    Operaciones de consulta
    - No modifican ninguna relación existente.
    - Por lo tanto no violan ningún tipo de restricción.

    Operaciones de inserción de tuplas
    - Pueden violar restricciones de dominio, de unicidad y de integridad de entidad
      o referencial.
    - El SGBD debería rechazar una inserción que viola algún tipo de restricción.

    Operaciones de eliminación
    - Sólo pueden violar restricciones de integridad referencial.
    - Cuando R referencia a S, y se intenta eliminar una tupla de S que es
      referenciada por alguna/s tupla/s en R.
    - Hay tres estrategias posibles: rechazar la eliminación, eliminar en cascada, o
      poner en NULL los atributos referenciales de las tuplas de R.

    Operaciones de modificación
    - Si se modifica una clave foránea, se debe verificar que sus nuevos valores
      referencien a una tupla existente de la relación referenciada, o bien sean
      todos nulos. De lo contrario se debería rechazar la operación.
    - Si se modifica una clave primaria, puede violarse cualquiera de las
      restricciones de integridad, y se combinan las situaciones indicadas para
      inserción y eliminación.

    A veces es necesario realizar una serie de operaciones por completo, o bien
    no realizarlas
    - Surge el concepto de transacción, como conjunto ordenado de operaciones que, o
      se ejecutan por completo, o no se ejecutan.
    - La ejecución de una transacción es a todo o nada.
    - Si una transacción no puede terminar de realizarse porque una de sus
      operaciones viola alguna restricción de integridad, entonces debe dejarse
      la base de datos en el estado anterior al inicio de la misma.
* Pasaje del modelo conceptual al modelo relacional
** Principios
*** ¿Cómo transformamos nuestro modelo ER en un modelo relacional? [ELM16 9]
    Cada entidad del modelo ER producirá generalmente una relación del modelo
    relacional.

    Hay excepciones!
    #+BEGIN_SRC language
Países(nombre_país, población, superficie) #+END_SRC

    Atributos multivaluados:
    #+BEGIN_SRC language
Médicos(legajo_médico, nombre_médico) Telefonos(legajo_médico, teléfono)
Mails(legajo_médico, mail) #+END_SRC

    Atributos compuestos:
    #+BEGIN_SRC language
TarjetasCrédito(MII, issuer_subid, cuenta, checksum, fecha_venc) #+END_SRC

    Se representan a través de sus sub-atributos simples.

    Cada interrelación N:M del modelo ER producirá una relación del modelo
    relacional.
    #+BEGIN_SRC language
Alumnos(padrón, nombre_alumno) Asignaturas(código_asignatura, nombre_asignatura)
Aprobaciones(padrón, código_asignatura, fecha_aprobación) #+END_SRC

    Cuando la cardinalidad es 1:1 tenemos varias posibilidades.

    Forma 1: “Relación asociada a la interrelación”
    #+BEGIN_SRC language
Gerentes(nombre_gerente, teléfono, mail) Departamentos(código_dpto, nombre_dpto)
Dirige(nombre_gerente, código_dpto) #+END_SRC

    Debemos elegir sólo una de las claves foráneas como clave primaria de
    Dirige.

    Forma 2a: Recomendada si Gerente tiene participación total
    #+BEGIN_SRC language
Gerentes(nombre_gerente, teléfono, mail, código_dpto) Departamentos(código_dpto,
nombre_dpto) #+END_SRC

    Una interrelación con cardinalidad 1:1 puede representarse incluyendo la
    clave primaria de una de las entidades participantes como clave foránea en
    la relación correspondiente a la otra entidad participante, siempre que esta
    última tenga participación total.

    Forma 2b: Recomendada si Departamento tiene participación total.
    #+BEGIN_SRC language
Gerentes(nombre_gerente, teléfono, mail) Departamentos(código_dpto, nombre_dpto,
nombre_gerente) #+END_SRC

    Forma 3: Ambas tienen participación total
    #+BEGIN_SRC language
GerentesDepartamentos(nombre_gerente, teléfono, mail, código_dpto, nombre_dpto)
#+END_SRC

    La clave puede ser o bien “nombre_gerente”, o bien “código_dpto”. Ambas son
    claves candidatas. En este caso hemos elegido la primera como clave
    primaria.

    Con cardinalidad 1:N:
    #+BEGIN_SRC language
    Futbolistas(nombre_futbolista, f_nac, país) Clubes(nombre_club, país,
    división) JuegaEn(nombre_futbolista, nombre_club, país) #+END_SRC

    Aunque si Futbolista tuviera participación total sería conveniente:
    #+BEGIN_SRC language
    Futbolistas(nombre_futbolista, f_nac, país_futbolista, nombre_club,
    país_club) Clubes(nombre_club, país_club, división) #+END_SRC

    Entidades débiles:
    #+BEGIN_SRC language
    Hoteles(nombre_hotel, dirección) Habitaciones(número_habitación,
    nombre_hotel, capacidad) #+END_SRC

    Nota: No tiene sentido agregar una relación que represente la interrelación
    “tiene”.

    Generalización/Especialización:
    #+BEGIN_SRC language
    Personas(DNI, nombre_persona) Alumnos(DNI, padrón) Docentes(DNI, legajo,
    fecha_alta) #+END_SRC

    Unión:
    #+BEGIN_SRC language

    Personas(id_persona, nombre_persona) PersonasFísicas(DNI, fecha_nacimiento,
    id_persona) PersonasJurídicas(CUIT, fecha_constitución, id_persona)
    #+END_SRC

    En este ejemplo debemos crear una clave subrogada para identificar a las
    Personas.

    Interrelaciones ternarias
    - Con cardinalidad N:N:N
      En cada película (Star Wars, ...), distintos actores (Harrison Ford,
    Carrie Fisher, ...) interpretan distintos personajes (Han Solo, Princesa
    Leia, ...). A veces un mismo actor puede interpretar más de un personaje en
    una misma película, e inclusive un mismo personaje en una película puede ser
    interpretado por más de un actor. Por último, existen personajes que
    aparecen en muchas películas.

    Se crea una relación que representa a la interrelación.

    #+BEGIN_SRC language
    Actores(nombre_actor, país) Películas(nombre_película, año)
    Personajes(nombre_personaje) Interpreta(nombre_actor, nombre_película,
    nombre_personaje) #+END_SRC

    - Con cardinalidad 1:N:N
    En una escuela, los docentes enseñan distintas asignaturas (“Matemática”,
    “Literatura”, ...) en distintos cursos (3◦A, 3◦B, ...). Cada asignatura en
    cada curso es enseñada por un único docente.

    Recordemos que la cardinalidad de una entidad determina la cantidad de
    instancias de relación en que puede aparecer, fijadas las instancias de los
    otros tipos de entidades.

    #+BEGIN_SRC language
    Docentes(nombre_docente) Cursos(nombre_curso) Asignaturas(nombre_asignatura)
    Enseña(nombre_curso, nombre_asignatura, nombre_docente) #+END_SRC

    - Con cardinalidad 1:1:N
    En un hipódromo se corren varias carreras a diario, en las cuales participan
    jockeys y caballos. En una carrera, cada jockey está asociado a un caballo,
    y el caballo sólo es montado por ese único jockey. Sin embargo, en distintas
    carreras un jockey puede variar de caballo, y un mismo caballo puede ser
    montado por distintos jockeys.

    #+BEGIN_SRC language
    Caballos(nombre_caballo) Jockeys(nombre_jockey, peso) Carreras(día_carrera,
    hora_carrera, largo) Corre(día_carrera, hora_carrera, nombre_caballo,
    nombre_jockey) #+END_SRC

    {día_carrera, hora_carrera, nombre_jockey} también es clave candidata.

** Ejemplo
