bdd/03_modelo_relacional.html
<div id="outline-container-org418e677" class="outline-3">
<h3 id="org418e677">Operaciones</h3>
<div class="outline-text-3" id="text-org418e677">
</div>
<div id="outline-container-orgd21c477" class="outline-4">
<h4 id="orgd21c477">Operaciones</h4>
<div class="outline-text-4" id="text-orgd21c477">
<p>
Las operaciones del modelo relacional se especifican a través de lenguajes
como el álgebra relacional o el cálculo relacional.
</p>

<p>
Operaciones Consulta Actualización Inserción Eliminación Modificación
</p>
</div>
</div>
<div id="outline-container-orgd33dadf" class="outline-4">
<h4 id="orgd33dadf">Operaciones e integridad [ELM16 5.3]</h4>
<div class="outline-text-4" id="text-orgd33dadf">
<p>
Operaciones de consulta
</p>
<ul class="org-ul">
<li>No modifican ninguna relación existente.</li>
<li>Por lo tanto no violan ningún tipo de restricción.</li>
</ul>

<p>
Operaciones de inserción de tuplas
</p>
<ul class="org-ul">
<li>Pueden violar restricciones de dominio, de unicidad y de integridad de entidad
o referencial.</li>
<li>El SGBD debería rechazar una inserción que viola algún tipo de restricción.</li>
</ul>

<p>
Operaciones de eliminación
</p>
<ul class="org-ul">
<li>Sólo pueden violar restricciones de integridad referencial.</li>
<li>Cuando R referencia a S, y se intenta eliminar una tupla de S que es
referenciada por alguna/s tupla/s en R.</li>
<li>Hay tres estrategias posibles: rechazar la eliminación, eliminar en cascada, o
poner en NULL los atributos referenciales de las tuplas de R.</li>
</ul>

<p>
Operaciones de modificación
</p>
<ul class="org-ul">
<li>Si se modifica una clave foránea, se debe verificar que sus nuevos valores
referencien a una tupla existente de la relación referenciada, o bien sean
todos nulos. De lo contrario se debería rechazar la operación.</li>
<li>Si se modifica una clave primaria, puede violarse cualquiera de las
restricciones de integridad, y se combinan las situaciones indicadas para
inserción y eliminación.</li>
</ul>

<p>
A veces es necesario realizar una serie de operaciones por completo, o bien
no realizarlas
</p>
<ul class="org-ul">
<li>Surge el concepto de transacción, como conjunto ordenado de operaciones que, o
se ejecutan por completo, o no se ejecutan.</li>
<li>La ejecución de una transacción es a todo o nada.</li>
<li>Si una transacción no puede terminar de realizarse porque una de sus
operaciones viola alguna restricción de integridad, entonces debe dejarse
la base de datos en el estado anterior al inicio de la misma.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org8da5b96" class="outline-2">
<h2 id="org8da5b96">Pasaje del modelo conceptual al modelo relacional</h2>
<div class="outline-text-2" id="text-org8da5b96">
</div>
<div id="outline-container-org14a15fd" class="outline-3">
<h3 id="org14a15fd">Principios</h3>
<div class="outline-text-3" id="text-org14a15fd">
</div>
<div id="outline-container-orgee8aef7" class="outline-4">
<h4 id="orgee8aef7">¿Cómo transformamos nuestro modelo ER en un modelo relacional? [ELM16 9]</h4>
<div class="outline-text-4" id="text-orgee8aef7">
<p>
Cada entidad del modelo ER producirá generalmente una relación del modelo
relacional.
</p>

<p>
Hay excepciones!
</p>
<div class="org-src-container">
<pre class="src src-language">Países(nombre_país, población, superficie) #+END_SRC

    Atributos multivaluados:
    #+BEGIN_SRC language
Médicos(legajo_médico, nombre_médico) Telefonos(legajo_médico, teléfono)
Mails(legajo_médico, mail) #+END_SRC

    Atributos compuestos:
    #+BEGIN_SRC language
TarjetasCrédito(MII, issuer_subid, cuenta, checksum, fecha_venc) #+END_SRC

    Se representan a través de sus sub-atributos simples.

    Cada interrelación N:M del modelo ER producirá una relación del modelo
    relacional.
    #+BEGIN_SRC language
Alumnos(padrón, nombre_alumno) Asignaturas(código_asignatura, nombre_asignatura)
Aprobaciones(padrón, código_asignatura, fecha_aprobación) #+END_SRC

    Cuando la cardinalidad es 1:1 tenemos varias posibilidades.

    Forma 1: “Relación asociada a la interrelación”
    #+BEGIN_SRC language
Gerentes(nombre_gerente, teléfono, mail) Departamentos(código_dpto, nombre_dpto)
Dirige(nombre_gerente, código_dpto) #+END_SRC

    Debemos elegir sólo una de las claves foráneas como clave primaria de
    Dirige.

    Forma 2a: Recomendada si Gerente tiene participación total
    #+BEGIN_SRC language
Gerentes(nombre_gerente, teléfono, mail, código_dpto) Departamentos(código_dpto,
nombre_dpto) #+END_SRC

    Una interrelación con cardinalidad 1:1 puede representarse incluyendo la
    clave primaria de una de las entidades participantes como clave foránea en
    la relación correspondiente a la otra entidad participante, siempre que esta
    última tenga participación total.

    Forma 2b: Recomendada si Departamento tiene participación total.
    #+BEGIN_SRC language
Gerentes(nombre_gerente, teléfono, mail) Departamentos(código_dpto, nombre_dpto,
nombre_gerente) #+END_SRC

    Forma 3: Ambas tienen participación total
    #+BEGIN_SRC language
GerentesDepartamentos(nombre_gerente, teléfono, mail, código_dpto, nombre_dpto)
</pre>
</div>

<p>
La clave puede ser o bien “nombre_gerente”, o bien “código_dpto”. Ambas son
claves candidatas. En este caso hemos elegido la primera como clave
primaria.
</p>

<p>
Con cardinalidad 1:N:
</p>
<div class="org-src-container">
<pre class="src src-language">Futbolistas(nombre_futbolista, f_nac, país) Clubes(nombre_club, país,
división) JuegaEn(nombre_futbolista, nombre_club, país) #+END_SRC

Aunque si Futbolista tuviera participación total sería conveniente:
#+BEGIN_SRC language
Futbolistas(nombre_futbolista, f_nac, país_futbolista, nombre_club,
país_club) Clubes(nombre_club, país_club, división) #+END_SRC

Entidades débiles:
#+BEGIN_SRC language
Hoteles(nombre_hotel, dirección) Habitaciones(número_habitación,
nombre_hotel, capacidad) #+END_SRC

Nota: No tiene sentido agregar una relación que represente la interrelación
“tiene”.

Generalización/Especialización:
#+BEGIN_SRC language
Personas(DNI, nombre_persona) Alumnos(DNI, padrón) Docentes(DNI, legajo,
fecha_alta) #+END_SRC

Unión:
#+BEGIN_SRC language

Personas(id_persona, nombre_persona) PersonasFísicas(DNI, fecha_nacimiento,
id_persona) PersonasJurídicas(CUIT, fecha_constitución, id_persona)
</pre>
</div>

<p>
En este ejemplo debemos crear una clave subrogada para identificar a las
Personas.
</p>

<p>
Interrelaciones ternarias
</p>
<ul class="org-ul">
<li>Con cardinalidad N:N:N
En cada película (Star Wars, &#x2026;), distintos actores (Harrison Ford,</li>
</ul>
<p>
Carrie Fisher, &#x2026;) interpretan distintos personajes (Han Solo, Princesa
Leia, &#x2026;). A veces un mismo actor puede interpretar más de un personaje en
una misma película, e inclusive un mismo personaje en una película puede ser
interpretado por más de un actor. Por último, existen personajes que
aparecen en muchas películas.
</p>

<p>
Se crea una relación que representa a la interrelación.
</p>

<p>
#+BEGIN_SRC language
Actores(nombre_actor, país) Películas(nombre_película, año)
Personajes(nombre_personaje) Interpreta(nombre_actor, nombre_película,
nombre_personaje) #+END_SRC
</p>

<ul class="org-ul">
<li>Con cardinalidad 1:N:N</li>
</ul>
<p>
En una escuela, los docentes enseñan distintas asignaturas (“Matemática”,
“Literatura”, &#x2026;) en distintos cursos (3◦A, 3◦B, &#x2026;). Cada asignatura en
cada curso es enseñada por un único docente.
</p>

<p>
Recordemos que la cardinalidad de una entidad determina la cantidad de
instancias de relación en que puede aparecer, fijadas las instancias de los
otros tipos de entidades.
</p>

<p>
#+BEGIN_SRC language
Docentes(nombre_docente) Cursos(nombre_curso) Asignaturas(nombre_asignatura)
Enseña(nombre_curso, nombre_asignatura, nombre_docente) #+END_SRC
</p>

<ul class="org-ul">
<li>Con cardinalidad 1:1:N</li>
</ul>
<p>
En un hipódromo se corren varias carreras a diario, en las cuales participan
jockeys y caballos. En una carrera, cada jockey está asociado a un caballo,
y el caballo sólo es montado por ese único jockey. Sin embargo, en distintas
carreras un jockey puede variar de caballo, y un mismo caballo puede ser
montado por distintos jockeys.
</p>

<p>
#+BEGIN_SRC language
Caballos(nombre_caballo) Jockeys(nombre_jockey, peso) Carreras(día_carrera,
hora_carrera, largo) Corre(día_carrera, hora_carrera, nombre_caballo,
nombre_jockey) #+END_SRC
</p>

<p>
{día_carrera, hora_carrera, nombre_jockey} también es clave candidata.
</p>
</div>
</div>
</div>
