org/bdd/03_modelo_relacional.org
*** Librería “Jennifer”
    Los dueños de esta librería desean crear una base de datos de libros que
    contenga información sobre los libros actualmente en venta, y que permita
    hacer búsquedas por nombre o país de origen del autor, género, idioma y año.

    #+BEGIN_SRC language
    Autores(id_autor, nombre_autor, fecha_nacimiento, país) Libros(ISBN, nombre,
    idioma, año, unidades) Escribió(id_autor, ISBN) Géneros(código_género,
    nombre_género) Pertenece(ISBN, código_género) #+END_SRC

*** RENAPER
    El Registro Nacional de las Personas quiere mantener una base de datos con
    el nombre, DNI, género y fecha de nacimiento de cada ciudadano
    argentino. Asimismo desea tener registrados todos los matrimonios en curso
    (no divorciados) incluyendo la fecha de matrimonio, y los nacimientos de
    personas indicando la identidad de los padres en caso que la misma sea
    conocida.

    Hipótesis: Suponga que todas las personas son argentinas.

    #+BEGIN_SRC language
    Personas(DNI, nombre, género, fecha_nacimiento) HijoDe(DNI_padre, DNI_hijo)
    CasadaCon(DNI1, DNI2, fecha_matrimonio) #+END_SRC

* Bibliografía
  - [ELM16] Fundamentals of Database Systems, 7th Edition. R. Elmasri,
    S. Navathe, 2016. Capítulo 5, Capítulo 9
  - [GM09] Database Systems, The Complete Book, 2nd Edition. H. García-Molina,
    J. Ullman, J. Widom, 2009. Capítulo 2.1, 2.2, Capítulo 4.5, 4.6 Utiliza una
    notación distinta para la cardinalidad.
  - [SILB10] Database System Concepts, 6th Edition. A. Silberschatz, H. Korth,
    S. Sudarshan, 2010. Capítulo 2 Utiliza una notación distinta para la
    cardinalidad.

             