bdd/03_modelo_relacional.html

<div id="outline-container-org3d80d1a" class="outline-3">
<h3 id="org3d80d1a">Ejemplo</h3>
<div class="outline-text-3" id="text-org3d80d1a">
</div>
<div id="outline-container-org5f8f8cc" class="outline-4">
<h4 id="org5f8f8cc">Librería “Jennifer”</h4>
<div class="outline-text-4" id="text-org5f8f8cc">
<p>
Los dueños de esta librería desean crear una base de datos de libros que
contenga información sobre los libros actualmente en venta, y que permita
hacer búsquedas por nombre o país de origen del autor, género, idioma y año.
</p>

<p>
#+BEGIN_SRC language
Autores(id_autor, nombre_autor, fecha_nacimiento, país) Libros(ISBN, nombre,
idioma, año, unidades) Escribió(id_autor, ISBN) Géneros(código_género,
nombre_género) Pertenece(ISBN, código_género) #+END_SRC
</p>
</div>
</div>

<div id="outline-container-orgb4e72a3" class="outline-4">
<h4 id="orgb4e72a3">RENAPER</h4>
<div class="outline-text-4" id="text-orgb4e72a3">
<p>
El Registro Nacional de las Personas quiere mantener una base de datos con
el nombre, DNI, género y fecha de nacimiento de cada ciudadano
argentino. Asimismo desea tener registrados todos los matrimonios en curso
(no divorciados) incluyendo la fecha de matrimonio, y los nacimientos de
personas indicando la identidad de los padres en caso que la misma sea
conocida.
</p>

<p>
Hipótesis: Suponga que todas las personas son argentinas.
</p>

<p>
#+BEGIN_SRC language
Personas(DNI, nombre, género, fecha_nacimiento) HijoDe(DNI_padre, DNI_hijo)
CasadaCon(DNI1, DNI2, fecha_matrimonio) #+END_SRC
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org0b1ab1b" class="outline-2">
<h2 id="org0b1ab1b">Bibliografía</h2>
<div class="outline-text-2" id="text-org0b1ab1b">
<ul class="org-ul">
<li>[ELM16] Fundamentals of Database Systems, 7th Edition. R. Elmasri,
S. Navathe, 2016. Capítulo 5, Capítulo 9</li>
<li>[GM09] Database Systems, The Complete Book, 2nd Edition. H. García-Molina,
J. Ullman, J. Widom, 2009. Capítulo 2.1, 2.2, Capítulo 4.5, 4.6 Utiliza una
notación distinta para la cardinalidad.</li>
<li>[SILB10] Database System Concepts, 6th Edition. A. Silberschatz, H. Korth,
S. Sudarshan, 2010. Capítulo 2 Utiliza una notación distinta para la
cardinalidad.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
Last update: 2020-05-01 11:27
</div>
</body>
</html>
